# Método loc()

Documentação: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html

Este método é utilizado para acessar um grupo de linhas e colunas pelo rótulo (nomes de linhas ou colunas) ou condição booleana no Pandas. Ele permite, filtrar ou modificar valores de um dataframe de forma mais intuitiva, utilizando os nomes das colunas ou expressões booleanas.

A sintaxe básica é:

df.loc[linha, coluna]

## Exemplos documentação

In [78]:
import pandas as pd

### Exemplo 1)

In [79]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
                  index=['cobra', 'viper', 'sidewinder'],
                  columns=['max_speed', 'shield'])
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [80]:
# label único. Retorna a linha do tipo Series
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [81]:
# lista de labels. Retorna um dataframe
df.loc[['viper', 'sidewinder']]

            max_speed  shield
viper               4       5
sidewinder          7       8

In [82]:
# label único para linha e coluna
df.loc['cobra', 'shield']

2

In [83]:
# slice com labels para linha e label único para coluna
df.loc['cobra':'viper', 'max_speed']

cobra    1
viper    4
Name: max_speed, dtype: int64

# Exercícios (07/09/2024)

## Exercise 1) Basic Selection

Create a DataFrame with columns ['Name', 'Age', 'Score'] and 5 rows of data (use names, ages, and scores of your choice).
Use the loc() method to select and display the data of the third row.

In [84]:
import numpy as np
np.random.seed(42)

df = pd.DataFrame({'Name': ['Name1', 'Name2', 'Name3', 'Name4', 'Name5'],
                   'Age': np.random.randint(50, size=5),
                   'Score': np.random.randint(200, size=5)})
df

    Name  Age  Score
0  Name1   38    188
1  Name2   28     20
2  Name3   14    102
3  Name4   42    121
4  Name5    7     74

In [85]:
# loc() method to select and display data of the third row
df.loc[2]

Name     Name3
Age         14
Score      102
Name: 2, dtype: object

## Exercise 2) Row and Column Selection

From the same DataFrame, use loc() to select and display the values of the Name and Score columns for the first two rows.

In [86]:
df

    Name  Age  Score
0  Name1   38    188
1  Name2   28     20
2  Name3   14    102
3  Name4   42    121
4  Name5    7     74

In [87]:
# display the values of the Name and Score columns for the first two rows
df.loc[0:1, ['Name', 'Score']]

    Name  Score
0  Name1    188
1  Name2     20

## Exercise 3) Conditional Selection

Use loc() to filter and display all rows where the Score is greater than 80.

In [88]:
df.loc[df['Score'] > 80]

    Name  Age  Score
0  Name1   38    188
2  Name3   14    102
3  Name4   42    121

## Exercise 4) Modifying Data
Use loc() to update the Score of the person named "Name2" to 95. Display the updated DataFrame.

In [89]:
df.loc[df['Name']  == 'Name2', 'Score'] = 95
df

    Name  Age  Score
0  Name1   38    188
1  Name2   28     95
2  Name3   14    102
3  Name4   42    121
4  Name5    7     74

## Exercise 5) Slicing Rows and Columns
Use loc() to select a slice of data: rows 2 to 4 and columns ['Name', 'Score'] only. Display the result.

In [95]:
df.loc[2:4, ['Name', 'Score']]

    Name  Score
2  Name3    102
3  Name4    121
4  Name5     74